In [1]:
import numpy as np
import pandas as pd

In [2]:
df  = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
# wiki = pd.read_html('https://www.cnet.com/tech/mobile/best-iphone-2021-7-different-models-how/')
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]])
# df1 = pd.DataFrame(wiki[0])
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [5]:
df1.head(3)

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [6]:
df1.tail(3)

    0   1   2   3
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [7]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [8]:
df1.shape

(4, 4)

In [9]:
df1.iloc[0,1]

2

In [10]:
df1.iloc[0:2,0:2]

   0  1
0  1  2
1  5  6

In [11]:
df1.iloc[0:2,1:3]

   1  2
0  2  3
1  6  7

In [12]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]],columns=['A','B','C','D'])
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

## MERGING DATAFRAMES IN PYTHON USING PANDAS

In [15]:
df2 = pd.DataFrame([[1,2,3],[5,6,7],[9,10,11]], columns=['a','b','c'])

In [16]:
df2

   a   b   c
0  1   2   3
1  5   6   7
2  9  10  11

In [18]:
df3 =  pd.DataFrame([[1,2,3],[5,6,7],[9,10,11]], columns=['X','Y','Z'])

In [19]:
df3

   X   Y   Z
0  1   2   3
1  5   6   7
2  9  10  11

In [26]:
pd.merge(df2,df3,right_on='X', left_on='a')

   a   b   c  X   Y   Z
0  1   2   3  1   2   3
1  5   6   7  5   6   7
2  9  10  11  9  10  11